### 1. Import data into sql tables

In [3]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt

In [4]:
%load_ext sql
%sql sqlite:///nyc_inspection.db

'Connected: @nyc_inspection.db'

In [14]:
#function to read txt file into sql database
def sql_import(txtfile, tablename):
    """
    Read txt file into sql database
    Args:
    txtfile (str): txt file name 
    tablename (str): table name
    Returns:
    None
    """
    df=pd.read_csv(txtfile, error_bad_lines=False)
    conn=sqlite3.connect('nyc_inspection.db')
    df.to_sql(tablename, conn, if_exists='replace', index=False)

In [8]:
sql_import('WebExtract.txt', 'webextract')

C:\Users\Zhimin\AppData\Local\Continuum\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3220: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  if (yield from self.run_code(code, result)):

In [12]:
sql_import('Cuisine.txt', 'cuisine')

In [15]:
sql_import('Violation.txt', 'violations')

b'Skipping line 34: expected 8 fields, saw 9\nSkipping line 211: expected 8 fields, saw 9\nSkipping line 216: expected 8 fields, saw 9\nSkipping line 297: expected 8 fields, saw 9\nSkipping line 303: expected 8 fields, saw 9\nSkipping line 342: expected 8 fields, saw 9\nSkipping line 394: expected 8 fields, saw 9\n'

### 2. Remove Null values

For some restaurant, there is no score for a particular inspection date. Remove these records.

In [20]:
%%sql

--#count how many records need to be removed

SELECT COUNT(*)
FROM (SELECT camis, inspdate, SUM(score) AS count_score FROM webextract GROUP BY camis, inspdate)
WHERE count_score is NULL;

 * sqlite:///nyc_inspection.db
Done.

[(8255,)]

In [21]:
%%sql

--#remove the null score
--#create a temp table to store the new dataset, which is convinent and memory efficient

DROP TABLE IF EXISTS webextract_not_null;

CREATE TEMP TABLE webextract_not_null AS
SELECT *
FROM (SELECT camis, inspdate, SUM(score) as count_score FROM webextract GROUP BY camis, inspdate)
WHERE count_score is NOT NULL;

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [23]:
%%sql

--#new tabel to store all the data except the null score from webextract table

DROP TABLE IF EXISTS wtable;

CREATE TEMP TABLE wtable AS
SELECT * FROM (webextract
              INNER JOIN webextract_not_null
               ON webextract.camis=webextract_not_null.camis AND webextract.inspdate=webextract_not_null.inspdate);

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [25]:
%%sql

SELECT *
FROM wtable
LIMIT 5;

 * sqlite:///nyc_inspection.db
Done.

[(30075445, 'MORRIS PARK BAKE SHOP', 2, '1007      ', 'MORRIS PARK AVE                                   ', 10462.0, '7188924968', 8, '2014-03-03 00:00:00', 'D', '10F', 2.0, 'A', '2014-03-03 00:00:00', '2014-09-04 06:01:28.403000000', 30075445, '2014-03-03 00:00:00', 2.0),
 (30112340, "WENDY'S", 3, '469', 'FLATBUSH AVENUE', 11225.0, '7182875005', 39, '2014-07-01 00:00:00', 'F', '06A', 23.0, 'B', '2014-07-01 00:00:00', '2014-09-04 06:01:28.403000000', 30112340, '2014-07-01 00:00:00', 69.0),
 (30191841, 'DJ REYNOLDS PUB AND RESTAURANT', 1, '351', 'WEST 57 STREET', 10019.0, '2122452912', 3, '2013-07-22 00:00:00', 'D', '10B', 11.0, 'A', '2013-07-22 00:00:00', '2014-09-04 06:01:28.403000000', 30191841, '2013-07-22 00:00:00', 33.0),
 (40356483, "WILKEN'S FINE FOOD", 3, '7114      ', 'AVENUE U                        ', 11234.0, '7184443838', 27, '2014-05-29 00:00:00', 'D', '08C', 10.0, 'A', '2014-05-29 00:00:00', '2014-09-04 06:01:28.403000000', 40356483, '2014-05-29 00:00:00', 30.0),
 (30191841, 'DJ REYNOLDS PUB AND RESTAURANT', 1, '351', 'WEST 57 STREET', 10019.0, '2122452912', 3, '2013-07-22 00:00:00', 'D', '02G', 11.0, 'A', '2013-07-22 00:00:00', '2014-09-04 06:01:28.403000000', 30191841, '2013-07-22 00:00:00', 33.0)]

In [26]:
%%sql

SELECT COUNT(*)
FROM wtable;

 * sqlite:///nyc_inspection.db
Done.

[(522812,)]

### 3. Score by zip code

Find the average score for zip code where restaurants are above 100

In [27]:
%%sql

--#number of zip code
SELECT COUNT(*)
FROM (SELECT zipcode, COUNT(DISTINCT camis) AS num_camis
     FROM wtable
     GROUP BY zipcode
     HAVING num_camis>100);

 * sqlite:///nyc_inspection.db
Done.

[(87,)]

In [28]:
%%sql

--#how many unique restaurants

SELECT SUM(count)
FROM (SELECT COUNT(DISTINCT camis) AS count
     FROM wtable 
     GROUP BY zipcode);

 * sqlite:///nyc_inspection.db
Done.

[(24361,)]

In [29]:
%%sql

--#for each restaurant, use the latest inspection date's score

DROP TABLE IF EXISTS max_inspdate;

CREATE TEMP TABLE max_inspdate AS
SELECT zipcode, camis, MAX(inspdate) AS inspdate
      FROM wtable 
      GROUP BY zipcode, camis;

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [32]:
%%sql

DROP TABLE IF EXISTS zipcode;

CREATE TEMP TABLE zipcode AS 
SELECT DISTINCT wtable.zipcode, score, wtable.camis 
FROM wtable INNER JOIN max_inspdate ON 
wtable.zipcode=max_inspdate.zipcode AND wtable.camis=max_inspdate.camis AND wtable.inspdate=max_inspdate.inspdate

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [39]:
%%sql

--#get the score for each zip code
DROP TABLE IF EXISTS zipcode_score;

CREATE TEMP TABLE zipcode_score AS
SELECT zipcode, AVG(score), COUNT(DISTINCT camis) AS num_camis
FROM zipcode
GROUP BY zipcode
HAVING num_camis>100
ORDER BY AVG(score) DESC;

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [40]:
%%sql

SELECT COUNT(*)
FROM zipcode_score;

 * sqlite:///nyc_inspection.db
Done.

[(87,)]

In [41]:
result=%sql SELECT * FROM zipcode_score
dataframe=result.DataFrame()
dataframe[:10]

 * sqlite:///nyc_inspection.db
Done.

   ZIPCODE  AVG(score)  num_camis
0  11355.0   14.021390        187
1  11104.0   13.372727        110
2  11220.0   13.334426        305
3  11235.0   13.290698        172
4  10033.0   13.132743        113
5  11377.0   13.111650        206
6  11354.0   13.110465        344
7  10032.0   12.913043        115
8  11372.0   12.857605        309
9  11249.0   12.836735        147

According to zipcode definitions of [New York City Neighborhoods](https://www.health.ny.gov/statistics/cancer/registry/appendix/neighborhoods.htm), the first ten zip codes with highest scores are Northeast Queens, Northwest Queens, Sunset Park Brooklyn, Sounthern Brooklyn, Inwood and Washington Heights Manhattan, West Queens, North Queens, Inwood and Washington Heights Manhattan, West Queens, Brooklyn.

### 4. Score by borough

Find the average score for five borough in NYC.

In [43]:
%%sql 

DROP TABLE IF EXISTS boro_lascore;

CREATE TEMP TABLE boro_lascore AS
SELECT boro, camis, MAX(inspdate) AS inspdate
FROM wtable
GROUP BY boro, camis;

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [44]:
%%sql

DROP TABLE IF EXISTS join_wtable;

CREATE TEMP TABLE join_wtable AS
SELECT *
FROM wtable
INNER JOIN boro_lascore 
ON wtable.boro=boro_lascore.boro AND wtable.camis=boro_lascore.camis AND wtable.inspdate=boro_lascore.inspdate;

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [45]:
%%sql

DROP TABLE IF EXISTS boro_dins;

CREATE TEMP TABLE boro_dins AS 
SELECT DISTINCT boro, score, camis
FROM join_wtable;

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [46]:
%%sql

DROP TABLE IF EXISTS score_by_borough;

CREATE TEMP TABLE score_by_borough AS
SELECT boro, AVG(score), COUNT(DISTINCT camis) AS num_camis
FROM boro_dins
GROUP BY boro
ORDER BY AVG(score);

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [53]:
%%sql

DROP TABLE IF EXISTS borough;

CREATE TEMP TABLE borough AS
SELECT *
FROM score_by_borough
WHERE boro in (1, 2, 3, 4, 5);

 * sqlite:///nyc_inspection.db
Done.
Done.

[]

In [56]:
result=%sql SELECT * FROM borough
df=result.DataFrame()
df

 * sqlite:///nyc_inspection.db
Done.

   BORO  AVG(score)  num_camis
0     2   10.776852       2281
1     1   11.489637       9891
2     3   11.596854       5849
3     4   11.822596       5417
4     5   11.899123        912

In [57]:
dic={1: 'MANHATTAN', 2: 'THE BRONX', 3: 'BROOKLYN', 4: 'QUEENS', 5: 'STATEN ISLAND'}
df['BORO'].replace(dic, inplace=True)
df

            BORO  AVG(score)  num_camis
0      THE BRONX   10.776852       2281
1      MANHATTAN   11.489637       9891
2       BROOKLYN   11.596854       5849
3         QUEENS   11.822596       5417
4  STATEN ISLAND   11.899123        912